console.log('** Module 2. Lesson 4. Функции **')


// // *****************************************************************
// // Example 1 - Индекс массы тела

// // Напиши функцию calcBMI(weight, height) которая рассчитывает и возвращает 
// // индекс массы тела человека. Для этого необходимо разделить вес в 
// // киллограммах на квадрат высоты человека в метрах.

// // Вес и высота будут специально переданы как строки. Нецелые числа могут 
// // быть заданы в виде 24.7 или 24,7, то есть в качестве разделителя дробной 
// // части может быть запятая.

// // Индекс массы тела необходимо округлить до одной цифры после запятой;


// const calcBMI = function (weight, height) {
//   const bmi = Number((parseFloat(weight.replace(',', '.')) / parseFloat(height.replace(',', '.'))**2).toFixed(1))
//   return bmi
  
// }

// const bmi = calcBMI('88,3', '1.75');
// console.log(bmi); // 28.8


// // *****************************************************************
// // Example 2 - Меньшее из чисел

// // Напиши функцию min(a,b), которая возвращает меньшее из чисел a и b.

// const min = function (a, b) {
//   return a > b ? b : a;
// }

// console.log(min(2, 5)); // 2
// console.log(min(3, -1)); // -1
// console.log(min(1, 1)); // 1


// // *****************************************************************
// // Example 3 - Площадь прямоугольника

// // Напиши функцию getRectArea(dimensions) для вычисления площади прямоугольника со сторонами, 
// // значения которых будут переданы в параметр dimensions в виде строки. 
// // Значения гарантированно разделены пробелом.

// function getRectArea(dimensions) {
//   const dimensionsToArray = dimensions.split(' ');
//   console.log(dimensionsToArray);
  
//   const s = Number(parseFloat(dimensionsToArray[0])) * Number(parseFloat(dimensionsToArray[1]));
  
//   return s 
//   }
  
// console.log(getRectArea('8 11')); //88


// *****************************************************************


// *****************************************************************


// *****************************************************************


// *****************************************************************


// *****************************************************************


// *****************************************************************


// *****************************************************************


// *****************************************************************


// *****************************************************************